organization/apps/api/artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Spike test phase
    - duration: 60
      arrivalRate: 100
      name: "Spike test"

  # Timeout settings
  timeout: 10

  # Configure HTTP defaults
  http:
    timeout: 10

  # Performance thresholds
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    p95: 500 # 95th percentile response time should be under 500ms
    p99: 1000 # 99th percentile response time should be under 1000ms

  # Variables for test data
  variables:
    testEmail:
      - "loadtest1@example.com"
      - "loadtest2@example.com"
      - "loadtest3@example.com"
      - "loadtest4@example.com"
      - "loadtest5@example.com"

scenarios:
  # Scenario 1: Browse products without authentication
  - name: "Browse Products Flow"
    weight: 40
    flow:
      - get:
          url: "/products"
          expect:
            - statusCode: 200

      - get:
          url: "/products?page=1&limit=12"
          expect:
            - statusCode: 200

      - get:
          url: "/products?category={{ $randomString() }}"
          expect:
            - statusCode: 200

      - get:
          url: "/products?sortBy=price-asc"
          expect:
            - statusCode: 200

      - think: 2 # User reads product list for 2 seconds

      - get:
          url: "/products/{{ $randomString() }}"
          expect:
            - statusCode: [200, 404] # Product might not exist

  # Scenario 2: User registration and authentication
  - name: "User Authentication Flow"
    weight: 20
    flow:
      - post:
          url: "/auth/register"
          json:
            email: "perf-{{ $randomString() }}@example.com"
            password: "TestPassword123!"
            name: "Load Test User {{ $randomNumber(1, 10000) }}"
          capture:
            - json: "$.access_token"
              as: "token"
          expect:
            - statusCode: [201, 409] # 409 if user already exists

      - think: 1

      - get:
          url: "/auth/profile"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: [200, 401]

  # Scenario 3: Product search and filtering
  - name: "Product Search Flow"
    weight: 25
    flow:
      - get:
          url: "/products?search=laptop"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 1

      - get:
          url: "/products?search=phone&minPrice=100&maxPrice=1000"
          expect:
            - statusCode: 200

      - think: 1

      - get:
          url: "/products?category={{ $randomString() }}&sortBy=price-desc"
          expect:
            - statusCode: 200

  # Scenario 4: Complete checkout flow (authenticated)
  - name: "Checkout Flow"
    weight: 15
    flow:
      # Register/Login
      - post:
          url: "/auth/register"
          json:
            email: "checkout-{{ $randomString() }}@example.com"
            password: "TestPassword123!"
            name: "Checkout Test User"
          capture:
            - json: "$.access_token"
              as: "token"
          expect:
            - statusCode: [201, 409]

      # Browse products
      - get:
          url: "/products"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$.data[0].id"
              as: "productId"
          expect:
            - statusCode: 200

      - think: 2

      # Create order
      - post:
          url: "/orders"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            items:
              - productId: "{{ productId }}"
                quantity: 1
                price: 99.99
            shippingAddress:
              fullName: "Load Test User"
              streetAddress: "123 Test St"
              city: "Test City"
              state: "TS"
              zipCode: "12345"
              country: "USA"
              phone: "555-0123"
            subtotal: 99.99
            tax: 9.00
            shipping: 9.99
            total: 118.98
          expect:
            - statusCode: [201, 400, 401]

      - think: 1

      # View orders
      - get:
          url: "/orders"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: [200, 401]

# Admin endpoints performance test
  - name: "Admin Operations"
    weight: 5
    flow:
      # Login as admin (assumes admin exists)
      - post:
          url: "/auth/login"
          json:
            email: "admin@citadelbuy.com"
            password: "admin_password"
          capture:
            - json: "$.access_token"
              as: "adminToken"
          expect:
            - statusCode: [200, 401]

      # Get order stats
      - get:
          url: "/admin/orders/stats"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: [200, 401, 403]

      # Get product stats
      - get:
          url: "/admin/products/stats"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: [200, 401, 403]

      # Get all orders
      - get:
          url: "/admin/orders"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: [200, 401, 403]

# Payment endpoints stress test
  - name: "Payment Operations"
    weight: 5
    flow:
      # Register user
      - post:
          url: "/auth/register"
          json:
            email: "payment-{{ $randomString() }}@example.com"
            password: "TestPassword123!"
            name: "Payment Test User"
          capture:
            - json: "$.access_token"
              as: "token"
          expect:
            - statusCode: [201, 409]

      # Create payment intent
      - post:
          url: "/payments/create-payment-intent"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 99.99
            currency: "usd"
            orderId: "order-{{ $randomString() }}"
          expect:
            - statusCode: [201, 400, 401]

# Plugins for detailed metrics
plugins:
  expect: {}
  metrics-by-endpoint:
    # Group metrics by endpoint
    stripQueryString: true

# Custom metrics
  statsd:
    host: localhost
    port: 8125
    prefix: "citadelbuy.loadtest"